Autodesk.Navisworks.Api.CanceledOperationException
Exception thrown when an operation could not complete because the end user
has canceled it (usually through progress reporting).

Autodesk.Navisworks.Api.CanceledOperationException.#ctor
Creates a CanceledOperationException object

Autodesk.Navisworks.Api.CanceledOperationException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Creates a CanceledOperationException object

Autodesk.Navisworks.Api.CanceledOperationException.#ctor(System.String)
Creates a CanceledOperationException object
message: The error message that explains the reason for the exception.

Autodesk.Navisworks.Api.CanceledOperationException.#ctor(System.String,System.Exception)
Creates a CanceledOperationException object
innerException: The exception that is the cause of the current exception. If the innerException parameter is not null, the current exception is raised in a catch block that handles the inner exception.